
const censures = ["блять", "сука", "суки", "тварь", "твари", "хуйня",
    "хуй", "залупа", "пизда", "ебать", "ебаться", "говно",
    "гандоны", "гандон", "мразь", "мрази", "вагина", "бля",
    "хуета", "идиот", "идиоты", "пизду", "бляхамуха", "пидорасы", "пидоры", "ебал", "ебу", "нахуй",
    "дерьмо", "говно", "шлюха", "шлюхи"]

export const isNotCensureText = (value) => {
    let t = value.split(' ');
    for (let i = 0; i != t.length; i ++) {
        if (censures.indexOf(t[i].toLowerCase()) != -1) {
            return true
        }
    }
    return false;
}